In [2]:
import pandas as pd
import numpy as np

In [ ]:
# Head accept only one arguments
# if we want specific range of data from DF you have to use - df.iloc[1],df.iloc[1:5]
# what is the meaning of iloc - index based location

In [7]:
data = {'animal': ['dog','cat'],
       'age':[1,2],
       'visits':[np.nan,10],
        'priority':['yes','no']
       }

In [8]:
df = pd.DataFrame(data)

In [9]:
df

  animal  age  visits priority
0    dog    1     NaN      yes
1    cat    2    10.0       no

In [11]:
df.describe()

            age  visits
count  2.000000     1.0
mean   1.500000    10.0
std    0.707107     NaN
min    1.000000    10.0
25%    1.250000    10.0
50%    1.500000    10.0
75%    1.750000    10.0
max    2.000000    10.0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    2 non-null      object
 1   age       2 non-null      int64
 2   visits    1 non-null      float64
 3   priority  2 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 192.0+ bytes

In [13]:
# IF I want to insert one more column
# The count should be matched. if the counts are not matched it through the error

In [14]:
df['location']=['trichy','chennai']

In [15]:
df

  animal  age  visits priority location
0    dog    1     NaN      yes   trichy
1    cat    2    10.0       no  chennai

In [16]:
df[['animal','age']] #It will pick specified columns  only

  animal  age
0    dog    1
1    cat    2

In [17]:
for col in df.columns:
    series = df[col]
    print(series)

0    dog
1    cat
Name: animal, dtype: object
0    1
1    2
Name: age, dtype: int64
0     NaN
1    10.0
Name: visits, dtype: float64
0    yes
1     no
Name: priority, dtype: object
0     trichy
1    chennai
Name: location, dtype: object

In [22]:
df

  animal  age  visits priority location
0    dog    1     NaN      yes   trichy
1    cat    2    10.0       no  chennai

In [24]:
# Added specified column
df.loc[12] = ['frog',1,3,'yes','ch']

In [36]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [37]:
ind = ['a','b']
df1 = pd.DataFrame(data,index=ind)

In [38]:
df1

  animal  age  visits priority
a    dog    1     NaN      yes
b    cat    2    10.0       no

In [39]:
df1.drop('b')

  animal  age  visits priority
a    dog    1     NaN      yes

In [40]:
df1

  animal  age  visits priority
a    dog    1     NaN      yes
b    cat    2    10.0       no

In [41]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [44]:
df1.loc[:,['animal','age']] #df[['animal','age']] this are the two different approches

  animal  age
a    dog    1
b    cat    2

In [47]:
df.loc[df.index[[1,2]],['animal','age']] #we use the filteration method here

   animal  age
1     cat    2
12   frog    1

In [48]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [55]:
df[df['visits']>3]
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [56]:
df[(df['visits']>3) & (df["animal"]=="cat")]

  animal  age  visits priority location
1    cat    2    10.0       no  chennai

In [57]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch